ShaunG-RU/DRC-Project/STM32/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define GPIO_EXTI14_ENC1_SW_Pin GPIO_PIN_14
#define GPIO_EXTI14_ENC1_SW_GPIO_Port GPIOC
#define GPIO_EXTI14_ENC1_SW_EXTI_IRQn EXTI15_10_IRQn
#define GPIO_EXTI15_ENC2_SW_Pin GPIO_PIN_15
#define GPIO_EXTI15_ENC2_SW_GPIO_Port GPIOC
#define GPIO_EXTI15_ENC2_SW_EXTI_IRQn EXTI15_10_IRQn
#define GPIO_EXTI10_ENC3_SW_Pin GPIO_PIN_10
#define GPIO_EXTI10_ENC3_SW_GPIO_Port GPIOG
#define GPIO_EXTI10_ENC3_SW_EXTI_IRQn EXTI15_10_IRQn
#define GPIO_EXTI3_RST_SW_Pin GPIO_PIN_3
#define GPIO_EXTI3_RST_SW_GPIO_Port GPIOA
#define GPIO_EXTI3_RST_SW_EXTI_IRQn EXTI3_IRQn
#define GPIO_OUT_SPI2_DC_Pin GPIO_PIN_5
#define GPIO_OUT_SPI2_DC_GPIO_Port GPIOA
#define GPIO_OUT_SPI2_RST_Pin GPIO_PIN_0
#define GPIO_OUT_SPI2_RST_GPIO_Port GPIOB
#define GPIO_OUT_SPI2_CS_Pin GPIO_PIN_10
#define GPIO_OUT_SPI2_CS_GPIO_Port GPIOB
#define GPIO_EXTI11_ENC4_SW_Pin GPIO_PIN_11
#define GPIO_EXTI11_ENC4_SW_GPIO_Port GPIOB
#define GPIO_EXTI11_ENC4_SW_EXTI_IRQn EXTI15_10_IRQn
#define GPIO_OUT_PWR_EN_Pin GPIO_PIN_9
#define GPIO_OUT_PWR_EN_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
